# MinorLapSpliceLength Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricArea..::..MinorLapSpliceLength Property
FabricArea Class See Also
---
The fabric lap splice length in the fabric distribution in the minor direction.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public double MinorLapSpliceLength { get; set; }
```

Visual Basic
---
```text
Public Property MinorLapSpliceLength As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double MinorLapSpliceLength {
	double get ();
	void set (double value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | When setting this property: minorLapSpliceLength is greater than the half of the overall width. |

# See Also
FabricArea Class
Autodesk.Revit.DB.Structure Namespace